{
  "RK": [
    "The Pal Hop and the entire 60s garage band scene of central Maine can be traced directly back to the Royal Knights. The Knights originated the Pal Hop dances, and were the hands down winners of the very first Pal Hop \"Battle of the Bands.\" Guitarist and songwriter Eddy Boucher was the leader of the group. His brother Paul was the drummer and lead singer. Guy Matthews played rhythm guitar, and Bob Matthews played bass. Bob was replaced very early in the band's history by Ron Morin.",
    "The Royal Knights were the first of the Lewiston-Auburn rock groups to write and record original music, which they released on their own Fireball label, a tribute to their favorite mainstream band. Their first release covered two songs by the Fireballs, \"Long, Long Ponytail\" and \"Chief Whoopin-Koff.\" In every case, their records always included a pop vocal on one side, and a surf instrumental on the flip side. Their second 45 rpm single featured two original songs, \"Forever Little Girl\" and \"Knight-Mare,\" followed soon after by a third record with \"Yes It's Me\" and \"Sweet Revenge.\" A fourth acetate was cut but never released. One of the unissued songs, \"It's a Lie,\" was unveiled in a PBS news magazine program featuring the band. The flip side was titled \"Seven Veils of Arabia.",
    "In Portland, Maine during the 1960s they were the regular house band for a weekly televised teen dance program called \"Club Thirteens.\" During that period the Knights were offered a recording contract by a Swedish label but turned it down, only to find out later that some of their music from the Ace Recording Studio tapes was issued in Sweden anyway. Meanwhile, the songs \"Sweet Revenge\" and \"Yes It's Me\" were released on a Pepsi-Cola flexi-disc record. The band was scheduled to audition for a teenage \"beach party\" movie but their meeting with film executives was cancelled when anti-war marches broke out that day in Boston and disrupted the entire city. The meeting was never re-scheduled and the opportunity was lost. Although they never achieved major stardom, the Royal Knights made a big enough splash that today they are revered worldwide by surf band enthusiasts. Copies of their records frequently sell at collector shows and on the internet for several hundred dollars apiece.",
    "The band's musical talent and achievements have been touted by garage band historian Arem Heller and many others in the field who believe the Royal Knights remain one of the most tragically overlooked groups of that era. In 2010 the band came together one last time for the Pal Hop reunion concert where they unveiled a brand new song, \"The Last Hurrah\" which prompted Gold and Platinum record winning producer and songwriter Harry King to predict it would have been a number one hit if it had been released in the Sixties."
  ],
  "TRR": [
    "Originally the band was known as the \"Rockin-Rekons\", but eventually the spelling was changed and they became the \"Rockin' Recons.\" No one knows exactly why the change was made, or even precisely what a Recon is. One thing is certain - the Rockin\" Recons are legendary throughout Maine as one of the best original homegrown rock and roll bands of the Sixties.",
    "The band was formed in 1962 with Bob Blais (lead guitar), Richard Horton (bass), Ron Landry (drums), and Dave Brissette (guitar). Within a couple of years Dave left the band to join the Moon Dawgs and was replaced by Ron Vachon. The Recons made history as one of four groups to perform at the very first Pal Hop in Lewiston on April 10, 1964. Thereafter they played regularly at the Friday evening Pal Hop dances and other venues throughout the state.",
    "The Vietnam War abruptly put an end to the Recons until 1988 when the band reunited at the 40th birthday party of drummer Ron Landry. Over the years they added Roger Blais (formerly of the Innkeepers) on percussion, Mike Asselin (formerly with Sawdust) playing keyboards, and Denny Blais (son of Bob Blais) on bass and lead vocals. In 2007 Landry stepped down from the riser and was replaced by Doug Doyer.",
    "The Rockin' Recons never entered the recording studio during their early tenure. However, at the 2010 Pal Hop reunion they performed their very first original song titled \"Never Too Old to Rock and Roll,\" written exclusively for them by Platinum and Gold Record winning songwriter and producer Harry King. After the reunion they recorded other King songs including \"L-A\" which is a tribute to the cities of Lewiston and Auburn and was made into a music video by Pal Hop Days producer Bill Maroldo. The video took first place in the Androscoggin County Chamber of Commerce video contest held in the summer of 2012.",
    "The Rockin' Recons continue to play throughout Maine at dances, concerts and festivals. They recently announced plans to record a full length album of new songs by Harry King, along with a few select golden oldies."
  ],
  "MD" : [
    "The Moon Dawgs made an instant splash on the Maine music scene when they became one of four bands to share the stage at the very first Pal Hop dance in 1964. Their popularity led to bigger venues as opening acts for the Dave Clark Five, the Kingsmen, Freddie and the Dreamers, and the Searchers. Except for a few brief interruptions, the Dawgs have remained together over 50 years playing for legions of die-hard fans at benefit dances, concerts and festivals.",
    "Almost from the beginning, the band has featured Roger Michaud (lead singer and keyboards), Dave Brissette (guitar), Bob Poulin (bass), and Bob Roy (drums). Two later additions to the band include Roger Renaud (saxophone) and Marty Lang (guitar).",
    "The Moon Dawgs were on the edge of stardom when producer Van Trevor accompanied lead singer Roger Michaud to New York to record two songs as Roger Lewis & the Moon Dawgs. Studio musicians and backup singers filled in for the rest of the band. A 45 rpm single featuring \"Don't Let Him\" and \"Harriet\" was released simueltaneously on the Karate label, a subsidiary of the national record company Audio Fidelity, and the PAL label which was a local pressing coordinated by Lewiston's Police Athletic League that ran the Pal Hop dances.",
    "The Moon Dawgs quickly launched a tour before enthusiastic crowds in the Canadian Maritime Provinces and Nova Scotia where their record was receiving major airplay. During the tour they met a young fan backstage named Anne Murray who went on to become a superstar. In October, 1965 \"Don't Let Him\" peaked at #2 on the WLOB-AM \"Big 30 Survey\" in Portland, Maine and immediately became the focus of an advertising campaign in Billboard Magazine with the optimistic slogan, \"As Maine goes, so goes the nation!\" Later, the Moon Dawgs made one more attempt on the PAL label with Van Trevor producing the songs \"Wild About You\" and \"Pretty Little Ramblin\" Rose.",
    "The band continued to play on and off throughout the 70s, 80s and 90s, performing for various charities and special events. And now, well into the 21st century, the Moon Dawgs continue to howl. Meanwhile, Michaud recently released his own solo album on CD, \"American Stories\" which includes the title song of the documentary \"Pal Hop Days.\""
  ],
  "TI": [
    "The Innkeepers were among the \"edgiest\" of Maine's 1960s garage bands. While other Pal Hop groups tried to emulate the Beatles and Dave Clark Five, the Innkeepers leaned towards the music of the Stones and Hendrix. The original members included Roger Blais (guitar), Dick Tribou (guitar), Larry Nadeau (bass), Ray Cyr (drums) and Mike Goff (vocals, tambourine). The band had a huge following of fans known as \"The 69ers\" who attended every Innkeepers gig, occasionally provoking fights and altercations while inspiring the band's reputation as \"the Bad Boys of Rock 'n Roll.\"",
    "In September, 1967 the band took first place in Maine in the \"Vox Band Battle for Stardom\" and was honored in Billboard Magazine for their high ranking among 1,000 bands in the national competition. This led to a recording session at Ace Studios in Boston where they performed two original songs, \"Trella\", and \"People Say.\" Neither of these songs were released until 1996 when a Boston-based company included them on a compilation CD titled, \"New England Teen Scene.\"",
    "On the evening of November 24, 1967 the Innkeepers were performing live at the Pal Hop when a fight began near the foot of the stage. Police attempted to break it up, and in the confusion an announcement was made to clear the dance floor and empty the building. The angry crowd poured into the streets where a riot ensued, breaking windows at city hall and leading to other acts of vandalism. The story made national news and put a permanent end to the legendary Friday night event.",
    "The band served as the opening act in Maine for various mainstream groups including Gary Lewis & the Playboys, and the Four Seasons. The Innkeepers performed one last time in 2010 for the Pal Hop reunion concert. It was the last time the band played together. Within two years, band members Mike Goff and Larry Nadeau had passed away."
  ],
  "TTT": [
    "Terry & the Telstars were one of the most successful 60s garage bands in Maine, sharing the stage with the Jimi Hendrix Experience, the Blues Magoos, Tommy James and the Shondells, and the Cowsills. The Telstars took second place in Maine in the \"Vox Band Battle for Stardom\" and were honored in Billboard Magazine for their high ranking in the national competion. This led to recording sessions at Ace Studios in Boston where the band recorded four original tunes. Two songs were released on a 45 rpm record in the late 60s during a brief period when they had changed their name to White Fluff. Those songs included the pop ballad \"Stoned Lonely\" and a whimsical ditty titled \"Vegetable Binge.\" They also recorded \"Reasons\" and \"Stop and Think\" which both sat on the shelf for 30 years before being released on the CD compilation \"New England Teen Scene.\"",
    "The original group included Terry McCarthy (lead guitar), Nick Knowlton (lead vocal), Peter Nadeau (keyboards), Roland Bichard (bass guitar), and Dan Caron (drums). Paul Roy replaced Bichard on bass guitar when the band reunited for the 2010 Pal Hop Reunion concert.",
    "Although Terry & the Telstars never achieved the fame they had anticipated, some of the band members later experienced national and international exposure. Drummer Dan Caron played with Oak which toured alongside Bob Seger and recorded two albums on the Mercury label. Their hit song \"King of the Hill\" reached #32 on the Billboard Hot 100 in the Summer of 1980. A year earlier Oak charted at #56 with \"This is Love.\"",
    "Nick Knowlton went on to become the lead singer of Katfish which spent six weeks on Billboard's Hot 100 in 1975 with a remake of the Beatles \"Dear Prudence.\" The song was released nationally on the Big Tree label, a subsidiary of Atlantic Records, and was widely distributed outside the U.S. on the Philips label. Knowlton sang lead vocals on the Katahdin album \"Hard Core Rock 'n Rolla\" released in 1982. He also recorded an album of solo material in 2008 titled, \"Letting Go,\" a tribute to his departed wife Joye.",
    "Another subsequent milestone was the 1986 CD solo release by Telstars keyboard player Peter \"Pierre\" Nadeau titled, \"Good Things Come to Those Who Wait.\" The song \"Girls-Boys\" from that album was turned into a music video by longtime Telstars friend and photographer Paul Langelier. Fifteen years later the video achieved cult status in Canada when Musique Plus, the Canadian music network, aired three archived videos of unknown artists from the 1980s. It became the station's most requested video, and helped launch the career of comedian Louis-Jose Houde who parodied the song in his own cover video."
  ],
  "TT": [
    "Not only were the Travelers the youngest band to ever play at the Pal Hop, they were also the only group with a female lead singer to regularly perform there. Like most of the Lewiston-Auburn groups, the band was composed of aspiring young musicians who were electrified by the Beatles appearance on the \"Ed Sullivan Show.\" The Travelers started out with Dan Martin (guitar and vocals), his brother Richard Martin (bass), Paul Turgeon (guitar), and Bert Breton (drums).",
    " When Jeannie Poulin joined the band as a singer and keyboardist, the Travelers were able to expand their song list to include popular music of the day featuring female singers like Grace Slick, Janis Joplin, and the Supremes. No other Lewiston-Auburn groups were doing that, and so the Travelers were unique to the Pal Hop crowd.",
    "After the Pal Hop ended, the Travelers continued to perform throughout central Maine, particularly along the Route 4 corridor. During this period Richard was replaced on bass by Andy Arsenault. Meanwhile, Jeannie married the lead guitarist and became Jeannie Martin. When drummer Bert Breton briefly left the band in 1984 the group performed as Cruzer and issued their first and only 45 rpm record, featuring \"Kiss Me with a Smile\" and \"Weekend Music.\"",
    "By 1988 Jeannie was focusing on a solo career with the release of her album, \"Just the Way I Am,\" produced by Harry King. A cover version of Gene Pitney's \"Down in the Boondocks\" landed her an appearance on the Nashville Network television program \"You Can Be a Star.\"",
    "The Travelers had not played together for several years when they reunited briefly for the Pal Hop 2010 reunion concert. Today, Jeannie continues to perform with five other divas who call themselves \"The Girls of L-A.\""
  ],
  "BE": [
    "Bob Elie is a world class drummer who began his music career in the early 1960s performing with several Maine bands including the Thunder Tones, Corals, Plastic Third, Northern Lights, and his own group Bob Elie & Fat Cat. He received international attention when on two separate occasions he set the world record for continuous drumming. In May, 1964 he performed for 30 hours on the PAL HOP stage at Lewiston City Hall. Eleven months later he played for 48 hours non-stop at the Rollerdrome across the river in Auburn.",
    "In 1972 Bob joined Peppermint Rainbow which already had two Billboard Top 40 hit songs and toured for several months with Tommy James & the Shondells. In 1980 he traveled the United States with a rock and roll show known as Gold Rush. This led him to Hollywood where he was hired to tour with Natalie Cole in the wake of her hit song \"Jump Start My Heart.” Shortly thereafter Cole underwent medical treatment and the tour was cancelled.",
    "A few months later, still stinging from disappointment, Bob turned down an offer to perform with Grace Slick and her band Jefferson Starship. Instead, he began his own business managing common area facilities for large shopping centers throughout Southern California, while continuing to play in small R&B combos.",
    "Although he lives in San Diego, Bob returns to Maine regularly where he has appeared in various music shows including the 2009 Museum L-A “Echoes in Time”, the 2010 PAL HOP Reunion concert, and the Great Falls Balloon Festival in 2012."
  ]
}


